import javax.swing.*;
public class Main {
    public static void main(String[] args) {
        int num;
        String text, str;
        text = JOptionPane.showInputDialog("Расписание");
        num = Integer.parseInt(text);

        switch (num){
            case 1:
                str = "Понидельник" + "\n8:00-9:20 Лб.1/404 Объектно-ориентированное программирование Абдыраимова К.С. 1-16 нед." +
                        "\n9:30-10:50 Объектно-ориентированное программирование Абдыраимова К.С. 1-16 нед.";
                break;
            case 2:
                str = "Вторник" +
                        "\n9:30-10:50 Лк.1/102 Инфокоммуникационные системы и сети Абдрасакова А.Б. 1-16 нед." +
                        "\n11:00-12:20  Лк.3/403 Java - программирования Абдыраимова К.С. 1-16 нед.";
                break;
            case 3:
                str = "Среда" +
                        "\n8:00-9:20 Лб.2/ИЦ-2 Организация вычислительных систем Тороев А.А. 1-16 нед." +
                        "\n9:30-10:50 Лк.1/102 Организация вычислительных систем Тороев А.А. 1-16 нед." +
                        "\n11:00-12:20 Лб.Общ 1/ИСТ Инфокоммуникационные системы и сети Абдрасакова А.Б. 1-16 нед." +
                        "\n13:00-14:20 Лб.Общ 1/ИСТ Java - программирования Абдыраимова К.С. 1-16 нед.";
                break;
            case 4:
                str = "Четверг" +
                        "\n11:00-12:20 Лк.1/202 (1-подгр.) Сетевые технологии Токтогулова Г.А. 1-16 нед." +
                        "\n13:00-14:20 Лб.1/404 (1-подгр.) Сетевые технологии Токтогулова Г.А. 1-16 нед.";
                break;
            case 5:
                str = "Пятница" +
                        "\n9:30-10:50 Лк.3/212 (2-подгр.) Экономика фирмы Каниметова А.Б. 1-16 нед." +
                        "\n11:00-12:20 \n" +
                        "\nПр.3/213 (2-подгр.) Экономика фирмы Каниметова А.Б. 1-16 нед.";
                break;
            case 6:
            case 7:
                str = "Выходной";
                break;
            default:
                str = "Неверно";

        }
        JOptionPane.showMessageDialog(null, str);
    }
}
